!#/bin/bash
#
# Написать скрипт, который создает не пустые файлы на одной машине и передает их на другую машину. 
# Скрипт запускается по CRON на первой машине. Также скрипт управляет временем хранения файлов на второй машине, 
# которое не должно превышать одной недели.
#
cd $HOME; # Переходим в домашний каталог пользователя из под которого выполняется скрипт
mkdir $HOME/rsync_backup; # Создаем каталог для файлов
cd $HOME/rsync_backup; # Переходим в только что созданный каталог
for i in {1..5}; do echo blablabla > $i.txt; done; # Создадим 5 не пустых txt файлов.
tar -zcf $HOME/rsync_backup/$(date +%Y%m%d'T'%T).tar.gz -C $HOME rsync_backup # Заархивируем директорию в которой лежат файлы и положим архив туда же
rm -rf $HOME/rsync_backup/{1..5}.txt # Удаляем созданные непустые файлы так как они уже заархивированы
rsync -a $HOME/rsync_backup/ root@84.201.177.137:/root/remote_backup # Передаем на второй сервер архив из папки rsync_backup
rm -rf $HOME/rsync_backup/* # Удаляем архив внутри директории через спец символ *
rm -rf $HOME/rsync_backup # Удаляем папку для бекапа
ssh root@84.201.177.137  "find /root/remote_backup/* -mtime +7 -delete; exit;" # Удаляем файлы старше 7 дней на второй машине


# Выдать скрипту права на испольнение chmod +x rsync_script.sh
# Запуск по крону каждые 10 минут: */10  * * * *
# crontab -e
# */10  * * * * /root/scripts/rsync_script.sh
# Исполнить скрипт ./rsync_scrpit.sh